START_BEFORE_JOIN = (
    "⊹₊⟡⋆ خوش اومدی ⋆⟡₊⊹\n"
    "اول کانال‌های زیر رو عضو شو بعد برگرد و شروع کن\n"
    "˖𝜗𝜚⋆₊˚"
)
BTN_JOINED = "عضو شدم ✓"

NOT_JOINED = (
    "⊹₊⟡⋆ هنوز یکی مونده ⋆⟡₊⊹\n"
    "کانال‌ها رو کامل بررسی کن و دوباره امتحان کن\n"
    "˖𝜗𝜚⋆₊˚"
)
BTN_CHECK = "بررسی عضویت 🔄"

WELCOME_AFTER_JOIN = "خوش اومدی"

FILE_SENT = "اینم چیزی که می‌خواستی.\nحالا دیگه بهونه‌ای نداری."
FILE_NOT_FOUND = "چیزی با این مشخصات پیدا نکردم."
ERROR = "یه چیزی خراب شد.\nتقصیر من نیست... احتمالاً."

OTL_INVALID = "این لینک معتبر نیست."
OTL_EXPIRED = "این لینک منقضی شده."
OTL_USED = "این لینک قبلاً استفاده شده."
OTL_WELCOME = "خوش اومدی.\nاینم فایلی که دنبالش بودی."

SUPPORT_PROMPT = "📩 تماس با پشتیبانی\n\nپیامت رو بنویس و بفرست.\nمستقیم می‌رسه به ادمین 👇"
SUPPORT_SENT = "✅ پیامت رسید به ادمین.\nبه‌زودی جواب می‌گیری."

BOOKS_MENU = "📚 لیست کتاب‌ها\n\nیکی رو انتخاب کن:"
BOOK_NOT_FOUND = "کتاب پیدا نشد."
BOOK_PAID_MSG = (
    "💳 این کتاب پولیه\n\n"
    "برای خرید، به ادمین پیام بده:\n"
    "📩 روی دکمه زیر بزن"
)
PAGES_MENU = "📖 {book}\n\nصفحه موردنظر رو انتخاب کن:"
